console.log("кот" > "код"); //true сравнение посимвольно, кодироака буквы т больше, чем д

console.log("2" + 2 * "2"); //24 сначала выполняется умножение, затем сложение, но т.к 1-е значение строка, то оно добавляется к результату умножения

console.log(undefined == null); //true правило - равны при нестрогом равенстве

console.log(undefined != null); //false  правило - uderfined и null равны при нестрогом равенстве, соответственно, неравенство неверно

console.log(null == 0); //false снова правило о нестрогом равенстве: null == только undifined

console.log(2 > "3"); //false строка '3' становится числом 3 при операции сравнения

console.log(null - false + true); //1  Логическое значение true становится 1, а false – 0, null становится 0

console.log(1 / "l"); //1 строка '1' становится числом 1 при операции деления

console.log("2" * "3"); //6 умножение -> строки становятся числами

console.log(4 + 5 + "O"); //9O первое действие-математическая операция, 2-е прицепляется текст

console.log("l" + 4 + 5); //145 т.к если хотя бы один операнд является строкой, то второй будет также преобразован в строку, следом третий

console.log("4" - 2); // 2 при вычитании строка 4 становится числом

console.log("4" - "4x"); //NaN нельзя вычесть из цифры текст

console.log("23" == 23); //true первое значение при сравнении становится числом

console.log(null == false); //false правило - uderfined и null равны при нестрогом равенстве, все остальные варианты неверны

console.log(" -4 " / 0 + 1); //-infinity деление на 0

console.log(null + 1); // 1 null преобразуется 0

console.log(undefined + null); //NaN undefined преобразуется в NaN, с которым невозможны математические действия

console.log(1 === "1"); //false строгое равенство, 2й - текст

console.log("2" > 10); //false 2>10  строка '2' становится числом 2

console.log(NaN == undefined); //false правило - uderfined и null равны при нестрогом равенстве, все остальные варианты неверны
