/* Проанализировав временной промежуток начиная  с 1800 и до 2020 года найти и вывести в консоль:
Год первого полета человека в космос и количество итераций которое потребовалось для поиска.
Количество високосных годов принадлежащих данному отрезку и количество итераций которое потребовалось для поиска.  */

// let year = 1800;
// let count = 0;
// while (year < 1961) {
// year ++;
// count ++
// }

// console.log(year);
// console.log(count);

// let hp = 2020 - 1800;
// let dmg = 4;
// count = 0;

// while (hp > 0) {
//     hp = hp - dmg;
//     count ++;
// }

// console.log(hp);
// console.log(count);

// const temp = 49;
// if (temp < -30) {
//   console.log(temp, "оставайтесь дома!");
// } else if (temp < -10) {
//   console.log(temp, "сегодня холодно");
// } else if (temp < 5) {
//   console.log(temp, "Не холодно");
// } else if (temp < 15) {
//   console.log(temp, "тепло");
// } else if (temp < 25) {
//   console.log(temp, "очень тепло");
// } else if (temp < 35) {
//   console.log(temp, "жарко");
// } else {
//   console.log(temp, "пекло");
// }

/* Работа с if-else */

/*  1. Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3. */

// let a = -3;
// if (a == 0) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* 2. Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3. */

// let a = 1;
// if (a > 0) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* 3. Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3. */

// let a = -3;
// if (a < 0) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* 4. Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3. */

// let a = 1;
// if (a >= 0) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* 5. Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3. */

// let a = -3;
// if (a <= 0) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* 6. Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3. */

// let a = 1;
// if (a != 0) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* 7.Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 'test', 'тест', 3. */

// let a = "test";
// if (a == 3) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* 8. Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном '1', 1, 3. */

// let a = 3;
// if (a === "1") {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* Работа с логическими переменными */
/* 1. Если переменная test равна true, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной. */

// let test = 1;
// if (test == true) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

// let result = test == true ? console.log("Верно") : console.log("Неверно");

/* 2. Если переменная test не равна true, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false. Напишите два варианта скрипта - с короткой записью и с длинной. */

// let test = true;
// if (test != true) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

// let result = test != true ? console.log("Верно") : console.log("Неверно");

/* Работа с && (и) и || (или) */
/* 1. Если переменная a больше нуля и меньше 5-ти, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 5, 0, -3, 2. */

// let a = -3;
// if (a > 0 && a < 5) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

/* 2. Если переменная a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной на экран. Проверьте работу скрипта при a, равном 5, 0, -3, 2.
 */
// let a = 2;
// if (a == 0 || a == 2) {
//   a += 7;
//   console.log("результат= ", a);
// } else {
//   a /= 10;
//   console.log("результат= ", a);
// }

/* 3. Если переменная a равна или меньше 1, а переменная b больше или равна 3, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания). Проверьте работу скрипта при a и b, равном 1 и 3, 0 и 6, 3 и 5. */

// let a = 0;
// let b = 5;

// if (a <= 1 && b >= 3) {
//   result = a + b;
//   console.log("Результат= ", result);
// } else {
//   result = a - b;
//   console.log("Результат= ", result);
// }

/* 4. Если переменная a больше 2-х и меньше 11-ти, или переменная b больше или равна 6-ти и меньше 14-ти, то выведите 'Верно', в противном случае выведите 'Неверно'. */

// let a = 10;
// let b = 5;

// let result =
//   (a > 2 && a < 11) || (b >= 6 && b < 14)
//     ? console.log("Верно")
//     : console.log("Неверно");

/* На switch-case */
/* Переменная num может принимать 4 значения: 1, 2, 3 или 4. Если она имеет значение '1', то в переменную result запишем 'зима', если имеет значение '2' – 'весна' и так далее. Решите задачу через switch-case. */

// let num = 3;

// switch (num) {
//   case 1:
//     result = "Зима";
//     console.log(result);
//     break;
//   case 2:
//     result = "Весна";
//     console.log(result);
//     break;
//   case 3:
//     result = "Лето";
//     console.log(result);
//     break;
//   case 4:
//     result = "Осень";
//     console.log(result);
//     break;
//   default:
//     console.log("Нет значений");
// }

/* Общие задачи */
/* 1. В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью). */

// let day = 30;

// if (day <= 10) {
//   console.log("Первая декада месяца");
// } else if (day <= 20) {
//   console.log("Вторая декада месяца");
// } else {
//   console.log("Третья декада месяца");
// }

/* 2. В переменной month лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень). */

// let month = 12;
// if (month >= 6 && month <= 8) {
//   console.log("Это лето");
// } else if (month >= 3 && month <= 5) {
//   console.log("Это весна");
// } else if (month >= 9 && month <= 11) {
//   console.log("Это осень");
// } else {
//   console.log("Это зима");
// }

/*  3. Дана строка, состоящая из символов, например, 'abcde'. Проверьте, что первым символом этой строки является буква 'a'. Если это так - выведите 'да', в противном случае выведите 'нет'.*/

// let str = "аbcdef";

// let result = str[0] == "a" ? console.log("да") : console.log("нет");

/* 4. Дана строка с цифрами, например, '12345'. Проверьте, что первым символом этой строки является цифра 1, 2 или 3. Если это так - выведите 'да', в противном случае выведите 'нет'. */

// let str = "22345";

// let result = str[0] <= "3" ? console.log("yes") : console.log("no");

/* 5. Дана строка из 3-х цифр. Найдите сумму этих цифр. То есть сложите как числа первый символ строки, второй и третий. */

// let str = "143";
// let result = Number(str[0]) + Number(str[1]) + Number(str[2]);
// console.log(result);

/* 6. Дана строка из 6-ти цифр. Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр. Если это так - выведите 'да', в противном случае выведите 'нет'. */

// let str = "112211";

// let result1 = Number(str[0]) + Number(str[1]) + Number(str[2]);
// let result2 = Number(str[3]) + Number(str[4]) + Number(str[5]);

// let total = result1 == result2 ? console.log("yes") : console.log("no");

/* Циклы while и for */
/* 1. Выведите столбец чисел от 1 до 100. */

// let a = 1;

// while (a <= 100) {
//   console.log(a);
//   a++;
// }

// for (; a <= 100; a++) {
//   console.log(a);
// }

/* 2. Выведите столбец чисел от 11 до 33. */

// let a = 11;

// while (a >= 11 && a <= 33) {
//   console.log(a);
//   a++;
// }

// for (; a >= 11 && a <= 33; a++) {
//   console.log(a);
// }

/* 3.  Выведите столбец четных чисел в промежутке от 0 до 100. */
// let a = 0;

// while (a <= 100) {
//   console.log(a);
//   a += 2;
// }

// for (; a <= 100; a += 2) {
//   console.log(a);
// }

/* 4. С помощью цикла найдите сумму чисел от 1 до 100. */

// let a = 1;
// let sum = 0;
// while (a <= 100) {
//   sum += a;
//   a++;
// }
// console.log(sum);

// for (a; a <= 100; a++) {
//   sum += a;
// }
// console.log(sum);

/* Работа с for для массивов */

/* 1. Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран. */

// let a = [1, 2, 3, 4, 5];

// for (let i = 0; i < a.length; i++) {
//   console.log(a[i]);
// }

/* 2.  Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for найдите сумму элементов этого массива. Запишите ее в переменную result.*/

// let a = [1, 2, 3, 4, 5];
// let summ = 0;

// for (let i = 0; i < a.length; i++) {
//   summ += Number(a[i]);
// }
// console.log(summ);

/* Задачи общие. */
/* 1. Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10. */

// let a = [2, 5, 9, 15, 0, 4];

// for (let i = 0; i < a.length; i++) {
//   if (Number(a[i]) > 3 && Number(a[i]) < 10) {
//     console.log(a[i]);
//   }
// }

/* 2. Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива. */

// let a = [0, -1, 1, -8, 5, 4];
// sum = 0;

// for (let i = 0; i < a.length; i++) {
//   if (Number(a[i]) > 0) {
//     sum += Number(a[i]);
//   }
// }
// console.log(sum);

/* 3. Дан массив с элементами 1, 2, 5, 9, 4, 13, 4, 10. С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением, равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего делать не надо. */

// let a = [1, 2, 4, 9, 4, 13, 4, 10];

// for (let i = 0; i < a.length; i++) {
//   if (Number(a[i]) == 4) {
//     console.log("Есть!");
//     break;
//   }
// }

/* 4. Дан массив числами, например: [10, 20, 30, 50, 235, 3000]. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5. */

// let a = [10, 20, 30, 50, 235, 3000];

// for (let i = 0; i < a.length; i++) {
//   let b = String(a[i]);
//   if (b[0] == "1" || b[0] == "2" || b[0] == 5) {
//     console.log(a[i]);
//   }
// }

/* 5. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'. */

// let a = [1, 2, 3, 4, 5, 6, 7, 8, 9];
// let b = 0;

// for (let i = 0; i < a.length; i++) {
//   b = a[i] * -1;
//   console.log(b);
// }

/* 6.Составьте массив дней недели. С помощью цикла for выведите все дни недели, а выходные дни выведите жирным. */

// let week = [
//   "понедельник",
//   "вторник",
//   "среда",
//   "четверг",
//   "пятница",
//   "суббота",
//   "воскресенье",
// ];

// for (let i = 0; i < week.length; i++) {
//   if (week[i] == "суббота" || week[i] == "воскресенье") {
//     console.log(week[i].bold());
//   } else {
//     console.log(week[i]);
//   }
// }

/* 7. Составьте массив дней недели. С помощью цикла for выведите все дни недели, а текущий день выведите курсивом. Текущий день должен храниться в переменной day. */

// let week = [
//   "понедельник",
//   "вторник",
//   "среда",
//   "четверг",
//   "пятница",
//   "суббота",
//   "воскресенье",
// ];

// let day = "четверг";

// for (let i = 0; i < week.length; i++) {
//   if (week[i] == day) {
//     console.log(week[i].italics());
//   } else {
//     console.log(week[i]);
//   }
// }

/* Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num. */

// let n = 1000;
// num = 0;

// while (n >= 50) {
//   n /= 2;
//   num++;
// }
// console.log("количество итераций= ", num);
// console.log("результат = ", n);
